/* 
 Copyright 2011, 2012 oracle. All rights reserved.
 OMLocalizable.strings for English
 Oracle Access Management - Mobile and Social
 
 MODIFIED   (MM/DD/YY)
 sativenk    09/13/25 - Authentication time-out error added
 asashiss    09/24/13 - Empty username error message
 asashiss    09/12/13 - Support for identity domain in native view
 sativenk    06/06/13 - Bug 16907007 
 sativenk    05/21/13 - Moved "authentication in progress" message here
 sativenk    03/10/13 - Support for Federated Authentication
 sativenk    11/06/12 - Bugs 14841041 and 14692298
 msadasiv    09/26/12 - OMCryptoService errors
 sativenk    10/03/12 - Creation
 */

/* All SDK errors and SDK non-UI messages shall go here. 
   They start with 0. They can go up to 09999. */
"00000" = "Operation completed successfully.";
"00001" = "Could not connect to server %1$@.";
"00002" = "OIC server returned error: %ld - %1$@";
"00003" = "URL %1$@ is invalid. It does not conform to RFC 2396.";
"00004" = "OIC Server URL is required.";
"00005" = "The user cancelled login operation.";
"00006" = "This device is not yet authenticated with OIC Server.";
"00007" = "No matching class is found for %1$@ authentication scheme.";
"00008" = "No authentication scheme is specified.";
"00009" = "Device registration has failed.";
"00010" = "User authentication has failed.";
"00011" = "Authentication scheme %1$@ is unknown to this SDK.";
"00012" = "Unable to open RP Authentication URL.";
"00013" = "Unable to open SSO Authentication URL.";
"00014" = "Client application is not authorized to participate in SSO.";
"00015" = "Application profile is invalid or it is not downloaded.";
"00016" = "User has denied access to location";
"00017" = "Presenter view controller can not be nil.";
"00018" = "The REST Request is invalid";
"00019" = "The user is not yet authenticated";
"00020" = "OIC server denied access token request.";
"00021" = "Setup API is not invoked.";
"00022" = "KeyChainItem key is nil";
"00023" = "Input value is invalid";

/*  OMCryptoService Messages */
"00024" = "Memory allocation failure.";
"00025" = "Random number generation system error - %ld.";
"00026" = "Requested length too short.";
"00027" = "Input text cannot be empty.";
"00028" = "Unknown or unsupported algorithm.";
"00029" = "Key cannot be empty.";
"00030" = "Key size not supported by algorithm.";
"00031" = "Initialization Vector length must match algorithm block size.";
"00032" = "Plain Text length not a multiple of block size. Padding Required.";
"00033" = "Unknown or unsupported padding.";
"00034" = "Encryption system error - %ld.";
"00035" = "Requested length not a multiple of 4.";
"00036" = "Salt required for chosen algorithm.";
"00037" = "Salt not supported for chosen algorithm.";
"00038" = "Cannot prefix salt when using a non-salted algorithm.";
"00039" = "Input not prefixed with algorithm name.";
"00040" = "Input must be NSString when Base64 encoding is enabled.";
"00041" = "Unknown input type. Must be NSString or NSData.";
"00042" = "Input length must be less than or equal to %ld.";
"00043" = "Keypair generation system error - %ld.";
"00044" = "Tag required to identify key in keychain.";
"00045" = "Keychain system error - %ld.";
"00046" = "Keychain item not found.";
"00047" = "Signing system error - %ld.";
"00048" = "Input signature cannot be empty.";
"00049" = "Verification system error - %ld.";
"00050" = "Decryption system error - %ld.";
"00051" = "Keychain Item already found.";
"00052" = "Unknown or unsupported key type";
"00053" = "Invalid keychain data protection level specified.";

"00100" = "Invalid user name or password.";
"00101" = "The user is not authorized.";
"00102" = "The Login URL is invalid.";
"00103" = "Client application is not registered. Cannot perform offline authentication.";
"00104" = "Client application not authorized to participate in SSO.";
"00105" = "External browser mode is not supported";
"00106" = "The custom authentication page does not have all the required credential fields.";
"00107" = "Logout is in progress. Login after logout is completed.";
"00108" = "The request is missing a required parameter, includes an invalid parameter value, includes a parameter more than once, or is otherwise malformed.";
"00109" = "The client is not authorized to request an authorization code using this method.";
"00110" = "The resource owner or authorization server denied the request.";
"00111" = "The authorization server does not support obtaining an authorization code using this method.";
"00112" = "The requested scope is invalid, unknown, or malformed.";
"00113" = "The authorization server encountered an unexpected condition that prevented it from fulfilling the request.";
"00114" = "The authorization server is currently unable to handle the request due to a temporary overloading or maintenance of the server.";
"00116" = "Authentication is already in progress.";
"00117" = "Given Token Endpoint is not valid.";
"00118" = "Invalid Token Endpoint or token Request is missing some required parameters or invalid value given for some parameters.";
"00119" = "User name is required.";
"00120" = "Authentication timed out.";

/* All UI messages shall start from 10001 */
"10001" = "Login";
"10002" = "Cancel";
"10003" = "User name";
"10004" = "Password";
"10005" = "Answer your security question";
"10006" = "Internet Identity Authentication";
"10007" = "Enter password";
"10008" = "Enter user name";
"10009" = "Enter answer";
"10010" = "Enter your credentials";
"10011" = "Sign In";
"10012" = "Security certificate is invalid. Tap Accept to connect anyway.";
"10013" = "Accept";
"10014" = "Security Warning !";
"10015" = "Certificate Summary";
"10016" = "Federated Authentication";
"10017" = "Loading ...";
"10018" = "Authentication is in progress ...";
"10019" = "Auto Login";
"10020" = "Remember Credentials";
"10021" = "Remember Username Only";
"10022" = "Identity Domain";
"10023" = "Enter identity domain";
